//*********************************************************************************************
//*практическая работа №9 варииант 8                                                          *
//*Выполнил Тарасов Александр группа 2ИСПд                                                    *
//*задание составить программу для нахождения минимального четного элемента массива           *
//*********************************************************************************************
using System;
class Program
{
    static void Main()
    {
        // 1. создание счетчика и случайных чисел
        Random rnd = new Random();
        int count = 0;
        Console.Title = "практическая10";
        Console.WriteLine("здравствуйте");

        // 2. создание массива
        double[,] a = new double[3, 3];

        Console.WriteLine("Массив:");
        for (int i = 0; i < 3; i++)
        {
            for (int j = 0; j < 3; j++)
            {
                // заполнение массива
                a[i, j] = Math.Round(rnd.NextDouble() * 50 - 25, 1);
                Console.Write(a[i, j] + "\t");

                // поиск отрицательных чисел
                if (a[i, j] < 0)
                {
                    count++;
                }
            }
            Console.WriteLine(); 
        }

        // 3. 
        Console.WriteLine();
        Console.WriteLine("Количество отрицательных: " + count);
        Console.ReadKey();
        
        
    }
}
